import numpy as np
import pandas as pd


df = pd.DataFrame({'col1':[5,3,2,4],
                   'col2':[10,45,22,5],
                   'col3':[6,2,43,6]},
                  index=list("ABCD"))
print(df)
'''
   col1  col2  col3
A     5    10     6
B     3    45     2
C     2    22    43
D     4     5     6
'''
############################################################
# 1. 인덱스 위치 슬라이싱
print("1. B 인덱스 위치 ~ 끝 \n", df.iloc[1:])
print("2. B 인덱스 위치 ~ C 위치 \n", df.iloc[1:2]) # #   위치는 end값 전까지.

print("3. B 인덱스 위치 ~ 끝, col2 위치 \n", df.iloc[1:, 1])

print("4. 인덱스 처음 위치 ~ C 까지, col2, col1 위치 \n", df.iloc[:3, [2,0]])

##########################################################################################
# 2. 컬럼 위치 슬라이싱
print("5. B 인덱스 위치 , col2 ~ 끝 \n", df.iloc[1, 1:])

print("6. A, B 인덱스 위치 , 처음~ col2 \n", df.iloc[[0,1], :2])
##########################################################################################
# 3. 인덱스, 컬럼 위치 슬라이싱
print("7. 인덱스 처음 위치 ~ C 까지, 처음~ col2 \n", df.iloc[ :3, :2])